{
  "app": {
    "name": "parcelLab",
    "short_description": "Check parcelLab order status based on your customers' order numbers",
    "long_description": "parcelLab enables perfect communication between shops and customers during shipment. With parcelLab you guide your customers through the entire shipping process. Communicate shipping problems at an early stage and turn one-time buyers into loyal customers. Shipping is more than delivery. The shipping process is the most emotional part of the customer journey. For the best shopping experience, you care for your customer from checkout to delivery via every communication channel.\n\nDelight your customers with a custom track & trace page, tailored shipping information and hand-picked offers directly in your shop. Turn one-time shoppers into loyal customers and monetize valuable traffic rather than entrusting it to UPS, FedEx & co.\n\nIf you would like to find out more about how parcelLab can benefit your business, please find out more: [here](https://parcellab.com/)\n\nThe parcelLab Zendesk app gives parcelLab customers the ability to:\n\n- easily get the most up-to-date delivery status of your customers' orders, by seamlessly integrating with parcelLab's powerful API\n- directly access in-depth order information, via a direct link to the corresponding parcelLab portal tracking page\n- automatically fetch the order status directly based on a user-configured Zendesk ticket field (optionally) or via an easy-to-use input form.",
    "installation_instructions": "The parcelLab App for Zendesk, lets you see the most recent delivery status of your customers' orders.\n\nIf you're not a parcelLab customer and you're interested in finding out more on how parcelLab can benefit your business, please visit [parcellab.com](https://www.parcellab.com)\n\nBefore you begin, you'll need your parcelLab user ID in order for the parcelLab Zendesk app to sucessfully access the order status of your customers' orders. You can find your parcelLab user ID in the in the account section of the parcelLab portal.\n\nOptionally if you prefer the parcelLab Zendesk app to automatically retrieve the order number from a Zendesk support ticket field, you'll need the Zendesk ticket field ID of the desired ticket field. You can find all available ticket fields and their corresponding unique ticket field IDs in the *Admin / Manage / Ticket Fields* section of your Zendesk app.\n\n# Getting Started\n\n1. Click the \"Install\" button above (on this page) to install the parcelLab Zendesk app in your Zendesk account.\n2. Enter your parcelLab user ID in the installation configuration field\n3. (Optionally) Enter the ticket field ID of a Zendesk ticket field that the parcelLab Zendesk app should use to automatically retrieve the order status when you open a support ticket. *Note*: You can also configure this at a later point.\n4. Click Update to save the configuration and complete the parcelLab Zendesk app installation.\n\nThat’s it! You'll now find the parcelLab Zendesk app in your Zendesk sidebar  when you open a ticket. It will automatically retrieve the order status if possible or ask you to enter an order number that you would like to check. After successfully getting the most recent order status, the parcelLab Zendesk app will offer you a list of all related deliveries, including their tracking numbers. You're able to view in-depth tracking information by directly clicking on each delivery status, which will then open up a new tab with the corresponding parcelLab portal tracking page.",
    "title": "parcelLab",
    "parameters": {
      "userId": {
        "label": "parcelLab user ID",
        "helpText": "This is your parcelLab user ID. You can find your parcelLab user ID in the account section of the parcelLab portal."
      },
      "orderNumberTicketFieldId": {
        "label": "(optional) Zendesk Ticket Field ID for automatic order number retrieval",
        "helpText": "This is the Zendesk ticket field ID that should correspond to the order number ticket field ID of your Zendesk support tickets. This identifier that can be found in the Zendesk admin overview under the 'manage / ticket fields' section. If you specify this ticket field ID, then the parcelLab Zendesk app will attempt to automatically retrieve the order number from the Zendesk ticket and fetch the corresponding order status from parcelLab. Leave this field empty, if you would like instead to be prompted to manually enter the order number."
      },
      "stripLeadingZerosFromOrderNumber": {
        "label": "(optional) Strip leading 0s from order number",
        "helpText": "If enabled leading 0s will be stripped off the order number before being sent to the parcelLab API"
      }
    }
  },
  "trackingStatus.lastupdated": "Last updated on",
  "trackingStatus.orderNumber": "Order #",
  "trackingStatus.orderNumberHint": "Enter the order number you would like to check",
  "trackingStatus.checkButton": "Check",
  "trackingStatus.deliveryStatus": "Delivery Status",
  "trackingStatus.trackingNumber": "Tracking Number",
  "trackingStatus.orderStatus": "Order status",
  "trackingStatus.error.title": "Error",
  "trackingStatus.warning.title": "Warning",
  "trackingStatus.error.fetch.badRequest": "Order number status could not be found. Please verify that the provided order number is valid.",
  "trackingStatus.error.fetch.serverError": "Encountered problems connecting to the parcelLab API. Please try again later. Response code: {{statusCode}}",
  "trackingStatus.warning.invalidOrderNumberTicketFieldId.message": "Could not automatically retrieve order number from Zendesk ticket. Please ensure that the configured order number ticket field ID is valid.",
  "trackingStatus.exception.close-aria-label": "Close Notification"
}